app/controllers/items_controller.rb

INSERT INTO "items" ("category", "close_time", "created_at", "description", "latitude", "longitude", "name", "open_days", "open_time", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "items" SET "name" = 'item 1', "description" = 'this is description', "building_number" = 9, "phone" = 8797653, "email" = 'hello@q.q', "website" = 'hello@sa.a', "updated_at" = '2012-11-22 04:33:27.150089' WHERE "items"."id" = 2
---
  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])